/*
* 51. Реализовать класс Triangle (задание 25) с полями-координатами вершин. Для
представления координат вершин используйте класс Point из задания 27.
* 25. Создать класс Triangle для представления треугольника. Требуется реализовать операции: получения
и изменения полей данных, вычисления площади, вычисления периметра,
вычисления высот, а также определения вида треугольника (равносторонний,
равнобедренный или прямоугольный).
* 27. Создать класс Point для работы с точками на плоскости. Координаты точки —
декартовы. Обязательно должны быть реализованы: перемещение точки по
оси Х, перемещение по оси У, определение расстояния до начала координат,
расстояния между двумя точками, преобразование в полярные координаты,
сравнение на совпадение и несовпадение.
*/

#include <iostream>
#include "Point.h"
using namespace std;

int main()
{
	/*
	Point x(1, 2);
	cout << x.GetX()<< endl;
	x.MovePointX(2);
	cout << x.GetX() << endl;
	x.MovePointY(2);
	cout << x.GetY() << endl;
	cout << x.DistanceToZero() << endl;
	Point a;
	cout << x.DistanceInBetween(a) << endl;
	double* c = new double;
	cout << x.Polar(c) << endl;
	cout << *c;
	if (!x.IsEqual(a)) { cout << "yea bruv ez"; }
	*/

}